# custom_light.yaml — лёгкая YOLOv1-inspired архитектура
nc: 5
channels: 3

backbone:
  - [-1, 1, Conv, [16, 3, 2]]      # 0: 640→320
  - [-1, 1, Conv, [32, 3, 2]]      # 1: 320→160
  - [-1, 1, Conv, [64, 3, 2]]      # 2: 160→80
  - [-1, 1, Conv, [64, 1, 1]]      # 3: bottleneck (снижение вычислений)
  - [-1, 1, Conv, [128, 3, 2]]     # 4: 80→40
  - [-1, 1, Conv, [128, 1, 1]]     # 5: bottleneck
  - [-1, 1, Conv, [256, 3, 2]]     # 6: 40→20
  - [-1, 1, SPPF, [256, 5]]        # 7: контекст без увеличения каналов

head:
  - [-1, 1, Conv, [128, 1, 1]]     # 8: проекция
  - [-1, 1, Conv, [128, 3, 1]]     # 9: финальные фичи
  - [[-1], 1, Detect, [nc]]        # 10: single-scale head